[
  {
    "label": "Cybersecurity",
    "desc": "The domain of computer science regarding to security",
    "rank": 10,
    "longDesc": "Cybersecurity is a broad field within computer science dedicated to protecting systems, networks, and data from malicious attacks. It falls under the umbrella of information security and risk management. As a parent domain, it encompasses subfields such as network security, application security, digital forensics, and threat intelligence. Popular tools and technologies in this domain include firewalls, intrusion detection systems, antivirus software, and encryption standards like SSL/TLS. Its principles are applied across industries such as finance, healthcare, and government to ensure data confidentiality, integrity, and availability."
  },
  {
    "label": "Network Security",
    "desc": "The domain of Cybersecurity related to networks and communication",
    "rank": 6,
    "longDesc": "Network Security is a specialized branch of cybersecurity that focuses on safeguarding data during transmission and protecting network infrastructures from intrusions. It falls under the broader cybersecurity and IT infrastructure domains. It acts as a parent for areas such as wireless security, network monitoring, and VPN management. Popular technologies include firewalls, VPNs, intrusion detection and prevention systems, and network segmentation tools. This domain is critical for securing enterprise networks, cloud environments, and IoT systems against evolving cyber threats."
  },
  {
    "label": "Application Security",
    "desc": "The domain of Cybersecurity related to applications",
    "rank": 6,
    "longDesc": "Application Security is a vital subdivision of cybersecurity that concentrates on protecting software applications from vulnerabilities and exploits. It falls under both cybersecurity and software development domains. It serves as a parent to practices such as secure coding, code review, vulnerability scanning, and penetration testing. Popular tools include static and dynamic analysis tools, web application firewalls, and secure development frameworks. Its techniques are essential for ensuring that web, mobile, and desktop applications remain resilient against cyberattacks."
  },
  {
    "label": "Programming",
    "desc": "The process of designing and building executable software.",
    "rank": 10,
    "longDesc": "Programming is a foundational domain in computer science that involves designing, writing, testing, and maintaining code to create software solutions. It falls under the broader fields of software development, systems engineering, and data science. It is the parent domain for numerous subfields including web development, mobile application development, and embedded systems. Popular programming languages and tools include Python, Java, C++, JavaScript, as well as IDEs like Visual Studio Code and IntelliJ, and version control systems like Git. The discipline drives innovation in technology by solving complex problems and powering virtually every digital application."
  },
  {
    "label": "Data strcutures",
    "desc": "Organizing and storing data efficiently for algorithms.",
    "rank": 6,
    "longDesc": "Data structures are essential building blocks in computer science used to organize, manage, and store data for efficient processing. They fall under the programming and algorithm design domains. They act as a parent concept to specific implementations such as arrays, linked lists, stacks, queues, trees, and graphs. Popular examples include binary search trees, hash tables, and heaps, which are integrated in many programming languages and frameworks. Mastery of data structures is crucial for optimizing algorithms and ensuring high performance in software applications."
  },
  {
    "label": "Functions",
    "desc": "Reusable blocks of code that perform specific tasks.",
    "rank": 4,
    "longDesc": "Functions are fundamental programming constructs that encapsulate reusable blocks of code to perform defined tasks. They fall under the programming and software development domains. They serve as a parent concept for advanced constructs such as methods in object-oriented programming and lambda expressions in functional programming. Popular usage spans many languages including Python, JavaScript, and Java, often supported by modern IDEs and debugging tools. Understanding functions is essential for writing modular, maintainable, and efficient code in any software project."
  },
  {
    "label": "Conditions",
    "desc": "Logical statements that control the flow of a program.",
    "rank": 4,
    "longDesc": "Conditions are logical constructs that control the execution flow in programming by evaluating expressions. They fall under the programming and software logic domains. They serve as a parent concept for branching structures such as if-else statements, switch cases, and conditional operators. Almost every programming language implements conditions with support from integrated development environments for debugging and testing. Mastery of conditional logic is crucial for developing robust algorithms and ensuring accurate decision-making in software applications."
  },
  {
    "label": "OOP",
    "desc": "A programming paradigm based on objects and classes.",
    "rank": 6,
    "longDesc": "Object-Oriented Programming (OOP) is a programming paradigm that organizes software design around objects and classes, promoting modularity and reusability. It falls under the core programming and software engineering domains. It serves as a parent for concepts such as inheritance, encapsulation, polymorphism, and abstraction. Popular languages like Java, C++, Python, and C# along with frameworks like Spring and .NET exemplify OOP principles. Its methodologies enable the development of scalable and maintainable systems in a wide range of applications."
  },
  {
    "label": "Visulisation",
    "desc": "The graphical representation of data and information.",
    "rank": 2,
    "longDesc": "Visualization is the practice of transforming data into graphical representations to uncover insights and trends. It falls under the data analysis and computer graphics domains. It serves as a parent concept for techniques such as charting, infographics, and interactive dashboards. Popular tools include Tableau, Power BI, D3.js, and libraries like Matplotlib and Seaborn in Python. Effective visualization is essential for clear communication, enabling decision-makers to interpret complex data quickly and accurately."
  },
  {
    "label": "GFX",
    "desc": "Graphics related skills and technologies.",
    "rank": 2,
    "longDesc": "GFX, short for graphics, encompasses the art and technology of creating visual content using digital tools. It falls under the digital art, computer graphics, and multimedia design domains. It acts as a parent for subfields such as animation, 3D modeling, and visual effects. Popular tools include Adobe Photoshop, Illustrator, Blender, and After Effects, which are widely used in both professional and creative industries. GFX is essential for producing engaging visuals in advertising, entertainment, gaming, and web design."
  },
  {
    "label": "JAVA",
    "desc": "A popular, object-oriented programming language.",
    "rank": 6,
    "longDesc": "JAVA is a widely adopted, object-oriented programming language known for its portability, scalability, and robustness. It falls under the programming and software development domains and is a key language in enterprise environments. It serves as a parent language for numerous frameworks and technologies such as Spring, Hibernate, and Android development. Popular development tools include IDEs like IntelliJ IDEA and Eclipse, and build tools like Maven and Gradle. Its vast ecosystem and strong community support have made JAVA a cornerstone in modern software engineering."
  },
  {
    "label": "Python",
    "desc": "A versatile, high-level programming language known for readability.",
    "rank": 6,
    "longDesc": "Python is a high-level, interpreted programming language celebrated for its readability and versatility across various domains. It falls under the programming, data science, and web development domains. It serves as a parent language for many libraries and frameworks such as Django, Flask, NumPy, and TensorFlow. Popular tools include Jupyter Notebook and PyCharm, which enhance its usability for both beginners and experts. Python's simplicity, combined with its powerful features, has made it one of the most popular languages in modern software development."
  },
  {
    "label": "Bash",
    "desc": "A Unix shell and command language for scripting.",
    "rank": 4,
    "longDesc": "Bash is a Unix shell and scripting language that provides a robust environment for automating tasks and managing system operations. It falls under the programming and systems administration domains. It serves as a parent to various shell scripting techniques and command-line utilities. Popular tools include GNU/Linux systems, terminal emulators, and text editors that facilitate script development and debugging. Bash is widely used by developers and system administrators to streamline processes, manage servers, and automate routine tasks."
  },
  {
    "label": "YAML",
    "desc": "A human-readable data serialization format.",
    "rank": 2,
    "longDesc": "YAML is a human-readable data serialization language widely used for configuration files and data exchange between applications. It falls under the data formatting and software configuration domains. It serves as a parent concept to other markup languages such as JSON and XML. Popular applications of YAML include Docker Compose, Kubernetes configuration files, and CI/CD pipeline setups. Its clear syntax and ease of use make YAML a preferred tool for developers and system administrators managing configuration data."
  },
  {
    "label": "C++",
    "desc": "A high-performance, object-oriented programming language.",
    "rank": 4,
    "longDesc": "C++ is a powerful programming language that supports both procedural and object-oriented paradigms, known for its high performance and efficiency. It falls under the programming and systems engineering domains. It serves as a parent language for numerous libraries and frameworks used in game development, real-time systems, and simulation software. Popular tools include IDEs such as Visual Studio, and compilers like GCC and Clang, which enable advanced feature implementations. Its robust performance makes C++ essential in industries ranging from embedded systems to financial modeling."
  },
  {
    "label": "Machine Learning",
    "desc": "A field of AI focused on building systems that learn from data.",
    "rank": 4,
    "longDesc": "Machine Learning is a dynamic branch of artificial intelligence that focuses on building systems capable of learning from data and improving over time. It falls under the AI, data science, and programming domains. It serves as a parent field for subdomains such as deep learning, reinforcement learning, and statistical modeling. Popular tools and frameworks include TensorFlow, Keras, PyTorch, and Scikit-Learn, which power various applications from predictive analytics to autonomous systems. Its techniques are transforming industries by enabling data-driven decision-making and innovative automation solutions."
  },
  {
    "label": "NLP",
    "desc": "Natural language processing that enables computers to understand human language.",
    "rank": 2,
    "longDesc": "Natural Language Processing (NLP) is a specialized area within artificial intelligence that focuses on enabling computers to understand, interpret, and generate human language. It falls under the AI and data science domains. It serves as a parent for tasks such as text analysis, sentiment analysis, machine translation, and chatbot development. Popular tools include libraries like NLTK, spaCy, and transformer-based models available through Hugging Face. NLP is essential for applications in voice assistants, automated customer service, and language translation, thereby enhancing human-computer interaction."
  },
  {
    "label": "VIM",
    "desc": "A highly configurable text editor for efficient coding.",
    "rank": 1,
    "longDesc": "VIM is a powerful and highly configurable text editor known for its efficiency and keyboard-driven navigation. It falls under the software development tools and productivity domains. It serves as a parent concept for various command-line editing techniques and custom scripting capabilities. Popular among developers, it supports an extensive ecosystem of plugins and extensions to tailor the editing experience. VIM’s lightweight design and extensive customization options make it indispensable for coding in diverse programming environments."
  },
  {
    "label": "IntelliJ",
    "desc": "A powerful integrated development environment for Java and other languages.",
    "rank": 1,
    "longDesc": "IntelliJ is a robust integrated development environment (IDE) widely used for JAVA and other programming languages. It falls under the software development tools and productivity domains. It acts as a parent platform for a variety of plugins and integrations that enhance coding, debugging, and project management. Popular features include intelligent code completion, refactoring tools, and version control integration, making it a favorite among professional developers. Its comprehensive feature set and user-friendly interface make IntelliJ a key tool in enterprise-level software development."
  },
  {
    "label": "Maven",
    "desc": "A build automation tool used primarily for Java projects.",
    "rank": 1,
    "longDesc": "Maven is a widely used build automation and project management tool that simplifies the process of building and managing Java applications. It falls under the software development and DevOps domains. It serves as a parent system for dependency management and standardized project configuration. Popular integrations with IDEs like IntelliJ and Eclipse, as well as support for automated testing and deployment, highlight its utility. Maven’s structured approach to project lifecycle management makes it essential for streamlining enterprise software development."
  },
  {
    "label": "Spring",
    "desc": "A framework for building enterprise-level Java applications.",
    "rank": 1,
    "longDesc": "Spring is a comprehensive framework designed to simplify the development of enterprise-level JAVA applications. It falls under the programming and software development domains, particularly in enterprise solutions. It acts as a parent framework for modules such as Spring Boot, Spring MVC, and Spring Security, which help streamline development processes. Popular tools and integrations include IDE support, Maven or Gradle for builds, and extensive community libraries. Spring’s modular architecture and robust ecosystem enable developers to build scalable and maintainable applications efficiently."
  },
  {
    "label": "Github",
    "desc": "A platform for version control and collaborative coding.",
    "rank": 4,
    "longDesc": "GitHub is a cloud-based platform that facilitates version control, collaborative coding, and project management using Git. It falls under the software development and DevOps domains. It serves as a parent service for repository hosting, code review, and continuous integration workflows. Popular features include GitHub Actions, issue tracking, and integration with numerous development tools. GitHub’s extensive ecosystem supports both open-source communities and enterprise projects, making it a central hub for modern software collaboration."
  },
  {
    "label": "Git",
    "desc": "A distributed version control system for tracking changes in source code.",
    "rank": 4,
    "longDesc": "Git is a distributed version control system that enables efficient tracking of changes in source code during software development. It falls under the software development and collaboration domains. It serves as a parent technology for version control systems and underpins platforms such as GitHub, GitLab, and Bitbucket. Popular commands and workflows like branching, merging, and commit history management are essential features of Git. Its robust design and widespread adoption make it indispensable for collaborative and scalable software development."
  },
  {
    "label": "Github Actions",
    "desc": "CI/CD workflows integrated into GitHub repositories.",
    "rank": 2,
    "longDesc": "GitHub Actions is an integrated continuous integration and continuous deployment (CI/CD) platform that automates workflows directly within GitHub repositories. It falls under the DevOps and software development domains. It serves as a parent tool for automating testing, building, and deployment pipelines. Popular use cases include automated testing suites, deployment scripts, and integration with third-party services. GitHub Actions streamlines software delivery processes by reducing manual intervention and enhancing overall development efficiency."
  },
  {
    "label": "Recursive",
    "desc": "A method where a function calls itself to solve problems.",
    "rank": 1,
    "longDesc": "Recursion is a fundamental programming technique in which a function calls itself to solve a problem by breaking it into smaller subproblems. It falls under the programming and algorithm design domains. It serves as a parent concept for divide-and-conquer strategies and iterative problem-solving approaches. Popular implementations can be found in languages such as Python, Java, and C++, where recursion is used for tasks like traversing data structures and sorting. Understanding recursion is essential for tackling complex computational problems and optimizing algorithms."
  },
  {
    "label": "Virtual Machines",
    "desc": "Software emulations of physical computers for isolation and testing.",
    "rank": 2,
    "longDesc": "Virtual Machines (VMs) are software-based emulations of physical computers that allow multiple operating systems to run on a single hardware platform. They fall under the systems administration and cloud computing domains. They act as a parent concept for virtualization and containerization technologies. Popular platforms include VMware, VirtualBox, and Hyper-V, which provide isolated environments for testing, development, and deployment. VMs are essential for resource optimization, scalability, and ensuring secure and isolated computing environments."
  },
  {
    "label": "Docker",
    "desc": "A platform for containerizing applications for consistency across environments.",
    "rank": 2,
    "longDesc": "Docker is a containerization platform that packages applications and their dependencies into portable containers to ensure consistency across different environments. It falls under the DevOps and cloud computing domains. It serves as a parent technology for container orchestration and microservices architectures. Popular tools include Docker Compose, Docker Swarm, and integrations with CI/CD pipelines. Docker revolutionizes application deployment by enabling scalable, reproducible, and isolated software environments."
  },
  {
    "label": "K4s",
    "desc": "An orchestration system for automating deployment of containerized apps.",
    "rank": 2,
    "longDesc": "Kubernetes (K4s) is an open-source container orchestration platform designed to automate the deployment, scaling, and management of containerized applications. It falls under the cloud computing and DevOps domains. It acts as a parent framework for managing clusters of containers and integrates with container tools like Docker. Popular features include self-healing, load balancing, and automated rollouts, supported by tools such as Helm and Istio. Kubernetes is essential for ensuring high availability and efficient resource management in modern cloud environments."
  },
  {
    "label": "APIS",
    "desc": "Interfaces that allow different software applications to communicate.",
    "rank": 4,
    "longDesc": "APIs (Application Programming Interfaces) are sets of protocols and tools that enable disparate software systems to communicate and exchange data. They fall under the software development and systems integration domains. They serve as a parent concept for web services, microservices, and third-party integrations. Popular technologies include RESTful APIs, GraphQL, and tools like Postman for testing and documentation. APIs are critical for building interconnected systems and driving innovation in web, mobile, and cloud applications."
  },
  {
    "label": "Scripting",
    "desc": "Automating tasks through small, efficient code scripts.",
    "rank": 4,
    "longDesc": "Scripting involves writing short programs to automate repetitive tasks and streamline workflows across computing environments. It falls under the programming and systems administration domains. It acts as a parent concept for various scripting languages such as Python, Bash, and PowerShell. Popular tools include text editors like Vim and IDEs that facilitate rapid script development and debugging. Scripting is essential for automating system tasks, enhancing productivity, and managing complex IT infrastructures efficiently."
  },
  {
    "label": "Automation",
    "desc": "Techniques to reduce human intervention through technology.",
    "rank": 4,
    "longDesc": "Automation leverages technology to perform tasks with minimal human intervention, streamlining processes and reducing error rates. It falls under the software development, systems administration, and DevOps domains. It serves as a parent concept for technologies such as scripting, robotics, and machine learning-driven processes. Popular tools and platforms include Jenkins, Ansible, and robotic process automation (RPA) software. Automation is essential for increasing efficiency, cutting costs, and accelerating both business and technical workflows."
  },
  {
    "label": "Github Pages",
    "desc": "A service for hosting static websites directly from GitHub.",
    "rank": 1,
    "longDesc": "GitHub Pages is a hosting service that allows users to deploy static websites directly from their GitHub repositories. It falls under the web development and content management domains. It acts as a parent service for static site generators and personal portfolio hosting solutions. Popular tools include Jekyll, Hugo, and Markdown, which simplify website creation and maintenance. GitHub Pages provides an accessible and cost-effective method for publishing content online while integrating seamlessly with Git-based workflows."
  },
  {
    "label": "Jira",
    "desc": "A project management tool for agile software development.",
    "rank": 1,
    "longDesc": "Jira is a project management and issue tracking tool widely used in agile software development environments. It falls under the project management and software development domains. It serves as a parent system for task organization, sprint planning, and bug tracking. Popular integrations include Confluence, Bitbucket, and agile frameworks that support iterative development. Jira is vital for organizing complex projects, ensuring transparency, and facilitating efficient communication among development teams."
  },
  {
    "label": "Slack",
    "desc": "A messaging platform for team collaboration.",
    "rank": 1,
    "longDesc": "Slack is a real-time messaging platform designed to enhance team collaboration and streamline communication. It falls under the software development and business communication domains. It acts as a parent tool for integrating various apps and automating workflows within organizations. Popular features include channel-based messaging, file sharing, and integrations with tools like GitHub, Trello, and Zoom. Slack improves productivity by centralizing communication and fostering a collaborative work environment."
  },
  {
    "label": "Google Workspaces",
    "desc": "Cloud-based productivity and collaboration tools by Google.",
    "rank": 1,
    "longDesc": "Google Workspaces is a suite of cloud-based productivity and collaboration tools offered by Google, designed to enhance organizational efficiency. It falls under the business productivity and IT collaboration domains. It serves as a parent suite for applications such as Gmail, Google Docs, Google Drive, and Google Calendar. Popular for its real-time editing and seamless integration with third-party applications, it streamlines workflow across teams. Google Workspaces is widely adopted in both educational and corporate settings for its scalability, security, and ease of use."
  },
  {
    "label": "AWS",
    "desc": "Amazon's comprehensive cloud computing platform.",
    "rank": 4,
    "longDesc": "Amazon Web Services (AWS) is a comprehensive cloud computing platform that offers a wide range of services including computing power, storage, databases, and machine learning tools. It falls under the cloud computing and IT infrastructure domains. It acts as a parent platform for services such as EC2, S3, Lambda, and RDS, supporting diverse computing needs. Popular tools within AWS include the AWS Management Console, CloudFormation, and AWS CLI, which streamline cloud operations. AWS is a dominant force in the cloud industry, providing scalable, secure, and innovative solutions for businesses of all sizes."
  },
  {
    "label": "Powershell",
    "desc": "A task automation and configuration management framework from Microsoft.",
    "rank": 1,
    "longDesc": "PowerShell is a command-line shell and scripting language developed by Microsoft for automating tasks and managing configurations. It falls under the systems administration and scripting domains. It serves as a parent technology for automating Windows-based operations and integrating with IT management tools. Popular for its robust command-line capabilities and extensive module support, PowerShell is widely used in enterprise environments. Its powerful automation features make it indispensable for managing large-scale Windows infrastructures and streamlining administrative tasks."
  },
  {
    "label": "Microcontroller Programmimg",
    "desc": "Programming small-scale computing devices embedded in systems.",
    "rank": 2,
    "longDesc": "Microcontroller Programming involves writing software for small-scale computing devices used in embedded systems and electronics. It falls under the programming and embedded systems domains. It acts as a parent concept for developing firmware, robotics, and IoT applications. Popular tools and platforms include Arduino, PIC microcontrollers, and development environments like MPLAB X and the Arduino IDE. Mastery of microcontroller programming is essential for creating efficient, resource-constrained systems in consumer electronics and industrial automation."
  },
  {
    "label": "javascript",
    "desc": "A versatile scripting language for web development.",
    "rank": 6,
    "longDesc": "JavaScript is a dynamic, high-level programming language that is essential for developing interactive web applications. It falls under the programming and web development domains. It serves as a parent language for frameworks and libraries such as React, Angular, and Vue.js, enabling rich client-side experiences. Popular tools include Node.js for server-side development and modern IDEs like Visual Studio Code that streamline its use. JavaScript's ubiquity and versatility make it a cornerstone technology for building responsive and user-centric web solutions."
  },
  {
    "label": "HTML",
    "desc": "The standard markup language for creating web pages.",
    "rank": 6,
    "longDesc": "HTML (HyperText Markup Language) is the fundamental language used to create and structure content on the World Wide Web. It falls under the web development and digital content creation domains. It serves as a parent technology for web design and is closely integrated with CSS and JavaScript. Popular tools for HTML development include text editors, web development IDEs, and browser developer tools that aid in coding and debugging. HTML is indispensable for building web pages and applications, providing the essential structure and semantics required for effective online communication."
  },
  {
    "label": "Rasberry Pi",
    "desc": "A small, affordable computer for learning programming and electronics.",
    "rank": 2,
    "longDesc": "Raspberry Pi is a compact, low-cost computer designed for educational purposes, prototyping, and experimentation. It falls under the embedded systems, programming, and IoT domains. It serves as a parent platform for learning computer science, electronics, and automation through hands-on projects. Popular tools include its native operating system, GPIO libraries, and a wide range of accessories that extend its functionality. Raspberry Pi has revolutionized access to computing, enabling innovative projects in home automation, robotics, and digital media."
  },
  {
    "label": "Arduino",
    "desc": "An open-source electronics platform for building digital devices.",
    "rank": 2,
    "longDesc": "Arduino is an open-source electronics platform that simplifies the process of building interactive digital devices and prototypes. It falls under the embedded systems, programming, and IoT domains. It serves as a parent platform for a wide variety of hobbyist and professional electronics projects, facilitating rapid prototyping and experimentation. Popular tools include the Arduino IDE, numerous microcontroller boards, and a rich ecosystem of sensors and actuators. Arduino’s accessibility and versatility have made it a fundamental tool in education, maker communities, and industrial prototyping."
  },
  {
    "label": "PID controllers",
    "desc": "Control loop mechanisms used in industrial control systems.",
    "rank": 1,
    "longDesc": "PID Controllers are feedback control systems used in industrial and engineering applications to maintain a desired output by adjusting process inputs. They fall under the control systems and automation domains. They serve as a parent concept for advanced control strategies used in robotics, manufacturing, and process control. Popular implementations include both analog and digital controllers, often paired with tuning software and simulation tools. PID controllers are essential for achieving precise control and stability in systems ranging from HVAC to industrial machinery."
  },
  {
    "label": "ssh",
    "desc": "A protocol for secure remote login and network services.",
    "rank": 2,
    "longDesc": "SSH (Secure Shell) is a cryptographic network protocol that provides secure remote access and command execution over unsecured networks. It falls under the cybersecurity and systems administration domains. It acts as a parent technology for secure remote communications, tunneling, and file transfer protocols. Popular tools implementing SSH include OpenSSH, PuTTY, and integrated terminal features in modern IDEs. SSH is indispensable for maintaining secure access to remote servers and managing networked systems safely."
  },
  {
    "label": "databases",
    "desc": "Organized collections of structured data for efficient access.",
    "rank": 6,
    "longDesc": "Databases are organized collections of structured data that enable efficient storage, retrieval, and management of information. They fall under the programming, data management, and information systems domains. They serve as a parent technology for various data models, including relational, NoSQL, and in-memory databases. Popular database systems include MySQL, PostgreSQL, MongoDB, and Oracle, which are used in a wide range of applications from web development to enterprise analytics. Effective database design and management are crucial for ensuring data integrity, scalability, and performance in modern software systems."
  },
  {
    "label": "sql",
    "desc": "A language for managing and querying relational databases.",
    "rank": 4,
    "longDesc": "SQL (Structured Query Language) is the standardized language used for managing, manipulating, and querying relational databases. It falls under the programming and data management domains. It serves as a parent technology for executing data operations such as insertion, update, deletion, and retrieval. Popular platforms that use SQL include MySQL, PostgreSQL, Microsoft SQL Server, and Oracle Database. Mastery of SQL is essential for data analysis, reporting, and building data-driven applications in virtually every industry."
  },
  {
    "label": "postgres",
    "desc": "A powerful open source object-relational database system.",
    "rank": 4,
    "longDesc": "Postgres, also known as PostgreSQL, is a robust and advanced open-source relational database system known for its extensibility and compliance with SQL standards. It falls under the data management and software development domains. It acts as a parent system for enterprise-level applications that require complex queries, transaction management, and analytical capabilities. Popular features include support for advanced SQL operations, JSON data types, and seamless integration with various programming languages and frameworks. PostgreSQL is widely adopted in web applications, data warehousing, and financial systems for its reliability and scalability."
  },
  {
    "label": "mongodb",
    "desc": "A NoSQL database known for its scalability and flexibility.",
    "rank": 4,
    "longDesc": "MongoDB is a leading NoSQL database that stores data in flexible, JSON-like documents, offering high scalability and adaptability. It falls under the data management and software development domains. It serves as a parent technology for document-oriented storage systems and big data applications. Popular features include its aggregation framework, horizontal scaling through sharding, and support for dynamic schemas. MongoDB is favored for modern applications that require rapid development, flexible data models, and the ability to handle large volumes of unstructured data."
  },
  {
    "label": "postman",
    "desc": "A collaboration platform for API development and testing.",
    "rank": 2,
    "longDesc": "Postman is a comprehensive platform used for API development, testing, and collaboration that streamlines the process of building and managing APIs. It falls under the software development and DevOps domains. It serves as a parent tool for API testing, documentation, and automated workflows. Popular features include a user-friendly interface, environment management, and integration with version control systems. Postman is essential for modern software engineering, enabling developers to design, test, and debug APIs efficiently."
  },
  {
    "label": "linux",
    "desc": "An open-source operating system based on Unix principles.",
    "rank": 4,
    "longDesc": "Linux is an open-source operating system known for its stability, security, and flexibility, built on Unix principles. It falls under the operating systems and software development domains. It serves as a parent platform for a wide range of distributions and is the foundation for many server and embedded systems. Popular distributions include Ubuntu, Fedora, and CentOS, with tools such as the Linux terminal and package managers enhancing its usability. Linux is integral to modern computing, powering everything from web servers and cloud platforms to personal desktops and IoT devices."
  },
  {
    "label": "windows",
    "desc": "A widely-used operating system developed by Microsoft.",
    "rank": 4,
    "longDesc": "Windows is a popular operating system developed by Microsoft, recognized for its user-friendly interface and broad software compatibility. It falls under the operating systems and enterprise software domains. It serves as a parent platform for a wide ecosystem of business and consumer applications, ranging from productivity software to gaming. Popular features include a graphical user interface, integration with Microsoft Office and Azure, and extensive hardware support. Windows remains a dominant force in personal computing and corporate environments due to its versatility and robust support."
  },
  {
    "label": "macOS",
    "desc": "Apple's operating system for Mac computers.",
    "rank": 4,
    "longDesc": "macOS is Apple's proprietary operating system designed for its Mac computers, offering a seamless and integrated user experience. It falls under the operating systems and digital design domains. It serves as a parent platform for creative and professional applications including graphic design, video editing, and software development. Popular tools include native applications like Final Cut Pro, Xcode, and the Finder, which contribute to its user-friendly environment. macOS is celebrated for its stability, security, and tight integration with the broader Apple ecosystem, making it a preferred choice for professionals and developers alike."
  },
  {
    "label": "Matlab",
    "desc": "A programming platform designed for engineers and scientists.",
    "rank": 2,
    "longDesc": "MATLAB is a high-level programming and numerical computing platform used extensively by engineers and scientists for data analysis, simulation, and algorithm development. It falls under the scientific computing, data analysis, and programming domains. It serves as a parent tool for modeling complex systems, performing mathematical computations, and visualizing data. Popular features include a rich library of toolboxes, an interactive environment, and seamless integration with hardware devices. MATLAB is widely utilized in academia and industry to prototype solutions and analyze complex engineering problems."
  },
  {
    "label": "Data Analysis",
    "desc": "The process of inspecting, cleansing, and modeling data.",
    "rank": 4,
    "longDesc": "Data Analysis is a systematic process of inspecting, cleaning, transforming, and modeling data to extract meaningful insights and support decision-making. It falls under the domains of data science, statistics, and programming. It serves as a parent concept for techniques such as statistical analysis, data mining, and data visualization. Popular tools include Python libraries like Pandas and NumPy, R, SQL databases, and visualization platforms such as Tableau. Effective data analysis is crucial for driving strategic decisions and solving complex problems across various industries."
  },
  {
    "label": "Audio and Speech processing",
    "desc": "Techniques for analyzing and processing audio and speech signals.",
    "rank": 2,
    "longDesc": "Audio and Speech Processing involves techniques for analyzing, modifying, and synthesizing sound and speech signals for a variety of applications. It falls under the signal processing, machine learning, and artificial intelligence domains. It serves as a parent field for technologies such as voice recognition, speech synthesis, and noise reduction. Popular tools include Python libraries like Librosa and frameworks such as TensorFlow for real-time processing. This domain is critical for developing applications like virtual assistants, hearing aids, and interactive voice response systems."
  },
  {
    "label": "Signal processing",
    "desc": "Analyzing, modifying, and synthesizing signals such as sound and images.",
    "rank": 2,
    "longDesc": "Signal Processing is the field focused on analyzing, modifying, and synthesizing signals including audio, images, and sensor data. It falls under the domains of electrical engineering, computer science, and applied mathematics. It serves as a parent concept for subfields such as digital signal processing, image processing, and audio analysis. Popular tools include MATLAB, Python libraries like SciPy, and specialized DSP hardware for real-time analysis. Signal processing techniques are essential for enhancing data quality and extracting meaningful information in various communication and multimedia applications."
  },
  {
    "label": "Linear Algebra and Graph Theory",
    "desc": "Mathematical foundations for solving systems and network problems.",
    "rank": 2,
    "longDesc": "Linear Algebra and Graph Theory are fundamental branches of mathematics that underpin many algorithms and computational methods in computer science. They fall under the domains of mathematics, computer science, and data analysis. They serve as parent concepts for advanced topics such as optimization, machine learning, and network analysis. Popular tools include MATLAB, Python libraries like NumPy and NetworkX, and academic software such as Mathematica. A strong grasp of these subjects is essential for developing efficient algorithms and solving complex problems in various technical fields."
  },
  {
    "label": "Algorithms",
    "desc": "Step-by-step procedures for solving computational problems.",
    "rank": 6,
    "longDesc": "Algorithms are systematic, step-by-step procedures used to solve computational problems and perform tasks efficiently. They fall under the domains of computer science, programming, and mathematics. They serve as a parent concept for a wide range of techniques including sorting, searching, and optimization algorithms. Popular examples include sorting algorithms, graph traversal methods, and dynamic programming approaches implemented in languages like Python, C++, and Java. A deep understanding of algorithms is essential for creating efficient software solutions and driving technological innovation."
  },
  {
    "label": "Dysktras Algorithm",
    "desc": "An algorithm for finding the shortest path in a graph.",
    "rank": 2,
    "longDesc": "Dysktra's Algorithm is a specific greedy algorithm designed to find the shortest path between nodes in a weighted graph. It falls under the domains of graph theory, algorithms, and computer science. It serves as a parent example of routing and optimization techniques used in network analysis and navigation systems. Popular implementations can be found in programming languages such as Python, Java, and C++, often utilizing data structures like priority queues. Mastery of Dysktra's Algorithm is essential for solving complex routing problems and optimizing network performance in various applications."
  },
  {
    "label": "Mobile Information Devices",
    "desc": "Portable computing devices that facilitate mobile communication.",
    "rank": 2,
    "longDesc": "Mobile Information Devices refer to portable computing devices such as smartphones, tablets, and wearables that facilitate mobile communication and data access. They fall under the domains of information technology, consumer electronics, and telecommunications. They serve as a parent category for mobile application development, wireless communication, and IoT integration. Popular operating systems include Android and iOS, with development tools like Xcode and Android Studio supporting their ecosystem. These devices have revolutionized communication by providing ubiquitous access to information and services on the go."
  },
  {
    "label": "Networks",
    "desc": "Systems that connect computers to share resources and data.",
    "rank": 6,
    "longDesc": "Networks are interconnected systems that enable the sharing of data, resources, and services between computers and devices. They fall under the domains of computer science, telecommunications, and cybersecurity. They serve as a parent concept for various subfields such as LAN, WAN, and wireless communication. Popular tools and technologies include routers, switches, firewalls, and protocols like TCP/IP and DNS. Networks are essential for facilitating communication in both local and global contexts, driving connectivity and innovation across industries."
  },
  {
    "label": "Discrete Maths",
    "desc": "Mathematical structures that are fundamentally discrete rather than continuous.",
    "rank": 2,
    "longDesc": "Discrete Maths is the study of mathematical structures that are inherently discrete and not continuous, such as integers, graphs, and logical statements. It falls under the domains of mathematics, computer science, and logic. It serves as a parent subject for topics like combinatorics, graph theory, and algorithm analysis. Popular tools include proof techniques, logical reasoning methods, and computational software like MATLAB and Mathematica. A strong foundation in discrete mathematics is essential for effective problem solving, cryptography, and the design of efficient algorithms."
  },
  {
    "label": "OSI network model",
    "desc": "A conceptual framework for standardizing network communications.",
    "rank": 4,
    "longDesc": "The OSI network model is a seven-layer conceptual framework used to understand and standardize network communications. It falls under the network engineering and telecommunications domains. It serves as a parent model for analyzing protocols and ensuring interoperability in communication systems. Popular tools include network simulators, protocol analyzers, and educational materials that break down each of the seven layers. Understanding the OSI model is fundamental for troubleshooting networks, designing secure communication systems, and optimizing data flow in complex infrastructures."
  },
  {
    "label": "Radio communications",
    "desc": "The transmission of information using radio waves.",
    "rank": 1,
    "longDesc": "Radio Communications involve the transmission and reception of information via radio waves across various distances. They fall under the domains of telecommunications, electronics, and cybersecurity. They serve as a parent concept for wireless communication technologies and broadcast systems. Popular tools include transceivers, antennas, and modulation techniques such as AM, FM, and digital radio standards. Radio communications are essential for broadcasting, emergency services, and remote data transmission in both public and private sectors."
  },
  {
    "label": "IoT",
    "desc": "The network of interconnected devices that communicate over the internet.",
    "rank": 4,
    "longDesc": "The Internet of Things (IoT) refers to the network of interconnected devices embedded with sensors and software that enable data exchange and automation. It falls under the domains of programming, embedded systems, and cybersecurity. It serves as a parent field for smart home technologies, industrial automation, and wearable devices. Popular tools and platforms include Arduino, Raspberry Pi, MQTT protocols, and cloud services such as AWS IoT and Azure IoT Hub. IoT is transforming industries by enabling real-time monitoring, data-driven decision-making, and innovative solutions across various sectors."
  },
  {
    "label": "Lwm2m",
    "desc": "A protocol for managing IoT devices and sensors.",
    "rank": 1,
    "longDesc": "LwM2M (Lightweight Machine to Machine) is a protocol designed for the efficient remote management and monitoring of IoT devices. It falls under the domains of IoT, telecommunications, and embedded systems. It serves as a parent protocol for device management and secure data exchange in constrained environments. Popular implementations include lightweight client libraries and platforms optimized for low power and limited resource usage. LwM2M is critical for managing large networks of IoT devices in applications such as smart cities and industrial automation."
  },
  {
    "label": "COAP",
    "desc": "A web transfer protocol for use with constrained nodes and networks.",
    "rank": 1,
    "longDesc": "CoAP (Constrained Application Protocol) is a specialized web transfer protocol designed for use with resource-constrained nodes and networks in IoT environments. It falls under the domains of IoT, network communications, and embedded systems. It serves as a parent protocol for lightweight messaging and data exchange in scenarios where bandwidth and power are limited. Popular implementations are found in microcontroller-based systems and IoT frameworks that require efficient, low-overhead communication. CoAP is essential for enabling communication in smart cities, environmental monitoring, and other applications requiring minimal resource consumption."
  },
  {
    "label": "UDP",
    "desc": "A connectionless communication protocol for network applications.",
    "rank": 2,
    "longDesc": "UDP (User Datagram Protocol) is a connectionless protocol that allows for fast, efficient data transmission with minimal overhead. It falls under the networking, telecommunications, and real-time communications domains. It serves as a parent protocol for applications that prioritize speed over guaranteed delivery, such as live streaming and online gaming. Popular use cases include VoIP services and real-time video applications, where low latency is critical. UDP is fundamental for scenarios requiring rapid data transfer and high performance across networks."
  },
  {
    "label": "HTTP(S)",
    "desc": "The protocols for transferring hypertext over the web securely.",
    "rank": 2,
    "longDesc": "HTTP(S) comprises the protocols used for transferring hypertext on the web, with HTTPS adding an essential layer of encryption for secure communication. It falls under the web development, cybersecurity, and network communications domains. It serves as a parent protocol for web browsing, API communication, and content delivery. Popular tools and technologies include web browsers, RESTful APIs, and web servers like Apache and Nginx that support these protocols. HTTP(S) is crucial for ensuring secure and reliable data exchange between clients and servers on the internet."
  },
  {
    "label": "TCP",
    "desc": "A reliable, connection-oriented communication protocol.",
    "rank": 2,
    "longDesc": "TCP (Transmission Control Protocol) is a connection-oriented protocol that guarantees reliable data transmission across networks through error checking and flow control. It falls under the networking, telecommunications, and computer science domains. It serves as a parent protocol for many internet-based applications, ensuring data integrity and sequential delivery. Popular protocols such as HTTP, FTP, and email services rely on TCP to maintain robust communication channels. TCP is a foundational technology for modern digital communication, enabling reliable data exchange on a global scale."
  },
  {
    "label": "TSL",
    "desc": "A protocol that provides secure communication over a computer network.",
    "rank": 1,
    "longDesc": "TSL (Transport Layer Security) is a cryptographic protocol designed to secure communications over computer networks by encrypting data transmissions. It falls under the cybersecurity, network communications, and IT infrastructure domains. It serves as a parent technology for secure connections and is often implemented alongside HTTPS and VPN protocols. Popular tools and libraries such as OpenSSL and various web server security modules support TSL implementations. TSL is critical for protecting sensitive data and ensuring the confidentiality and integrity of digital communications."
  },
  {
    "label": "X506",
    "desc": "A standard defining the format of public key certificates.",
    "rank": 1,
    "longDesc": "X506 is a widely recognized standard that defines the format of public key certificates used in various secure communication protocols. It falls under the domains of cybersecurity and cryptography. It serves as a parent standard for authentication mechanisms, encryption, and digital signatures in secure networks. Popular technologies utilizing X509 certificates include SSL/TLS protocols, VPNs, and secure email systems. X509 certificates are fundamental for establishing trust and securing data exchanges in both online services and enterprise environments."
  },
  {
    "label": "OPCUA",
    "desc": "An industrial communication protocol for secure data exchange.",
    "rank": 1,
    "longDesc": "OPC Unified Architecture (OPCUA) is an industrial communication protocol designed for secure and reliable data exchange in automation and control systems. It falls under the domains of industrial automation, cybersecurity, and information technology. It serves as a parent protocol for integrating diverse industrial devices and systems under a unified communication framework. Popular tools include OPC servers, client applications, and middleware solutions that facilitate standardized industrial connectivity. OPCUA is essential for modernizing manufacturing processes, ensuring interoperability, and enhancing the security of industrial operations."
  }
]
